## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_virtual_network.name will be created
  + resource "azurerm_virtual_network" "name" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "vnet-terraform-github-actions"
      + resource_group_name = "rg-terraform-github-actions"
      + subnet              = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>